In [15]:
import pandas as pd
import numpy as np

## If else elif conditions in Pandas

In [9]:
df = pd.DataFrame({
    'A': [10, 20, 30, 40],
    'B': [100, 200, 300, 400]
})

# Using apply for more complex conditions
df['C'] = df.apply(lambda row: 'High' if row['A'] > 20 and row['B'] > 200 else 'Low', axis=1)
df

    A    B     C
0  10  100   Low
1  20  200   Low
2  30  300  High
3  40  400  High

In [11]:
def categorize(row):
    if row['A'] > 30 and row['B'] > 300:
        return 'High'
    elif row['A'] > 20 and row['B'] > 200:
        return 'Medium'
    else:
        return 'Low'

df['C'] = df.apply(categorize, axis=1)
df

    A    B       C
0  10  100     Low
1  20  200     Low
2  30  300  Medium
3  40  400    High

__important, better than above for large data sets, also pd.cut will make sure the unseen category is also there during groupby().size() operation and shows 0 counts correctly, check LC1907__

In [17]:
df['C'] = pd.cut(df['A'], bins=[-np.inf, 20, 30, np.inf], labels=['Low', 'Medium', 'High'])
df

    A    B       C
0  10  100     Low
1  20  200     Low
2  30  300  Medium
3  40  400    High

## Lambda function on rows

In [34]:
temp = pd.DataFrame({'kobe':['MADdf kobe','asdfFAdf']})

temp['first_letter'] = temp.kobe.apply(lambda x: x[0])
temp

       kobe first_letter
0     MADdf            M
1  asdfFAdf            a

In [40]:
temp['kobe_NEW'] = temp['kobe'].apply(lambda x:x[0].upper() + x[1:].lower())

In [42]:
temp

       kobe first_letter  kobe_NEW
0     MADdf            M     Maddf
1  asdfFAdf            a  Asdffadf

## `agg` function

In [27]:

data = {
    'name': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob', 'Charlie', 'Charlie'],
    'category': [1, 2, 1, 2, 3, 2, 3]
}
df = pd.DataFrame(data)

# Step 1: Group by 'name' and get the nunique for 'category'
result = df.groupby('category')['name'].unique()
def unique_sorted(x):
    return np.sort(x.unique())

df = df.groupby('category')['name'].agg(['nunique',unique_sorted]).reset_index()
df

   category  nunique   unique_sorted
0         1        1         [Alice]
1         2        2  [Bob, Charlie]
2         3        2  [Bob, Charlie]

## cross join (make sure review outer join)

In [40]:
# LC 1280
def students_and_examinations(students: pd.DataFrame, subjects: pd.DataFrame, examinations: pd.DataFrame) -> pd.DataFrame:
    ex_summary = examinations.groupby(['subject_name','student_id']).size().to_frame(name='attended_exams').reset_index()
    merged_df = subjects.merge(students,how='cross').merge(ex_summary,how='left',on = ['student_id','subject_name'])
    merged_df['attended_exams'].fillna(0,inplace=True)
    return merged_df[['student_id','student_name','subject_name','attended_exams']].sort_values(by=['student_id', 'subject_name'])

## `and` vs. `&`

In [7]:
import numpy as np

# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': ['a', 'b', 'c', 'd', 'e']
})

# Correct way: Using &
filtered_df = df[(df['A'] > 2) & (df['B'] < 40)]
print("Filtered with &:")
filtered_df

Filtered with &:

   A   B  C
2  3  30  c

In [11]:
# Incorrect way: Using 'and'
try:
    filtered_df = df[df['A'] > 2 and df['B'] < 40]
    print("Filtered with 'and':")
    print(filtered_df)
except Exception as e:
    print("Error with 'and':", str(e))

Error with 'and': The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

## Pivot table and unstack method

In [16]:
import pandas as pd

# Create the DataFrame
data = {
    'date': ['1/1/2013', '1/1/2013', '1/1/2013', '1/2/2013', '1/2/2013', '1/3/2013', '1/3/2013', '1/3/2013'],
    'product_name': ['A', 'B', 'C', 'A', 'C', 'A', 'B', 'C'],
    'quantity_sold': [100, 200, 300, 101, 301, 102, 202, 302]
}

df = pd.DataFrame(data)

In [20]:
df['index'] = df.index

In [22]:
df

   A   B  C  index
0  1  10  a      0
1  2  20  b      1
2  3  30  c      2
3  4  40  d      3
4  5  50  e      4

In [84]:
temp = df.groupby(['date','product_name'])['quantity_sold'].sum().to_frame(name='total_sold').reset_index()
temp

       date product_name  total_sold
0  1/1/2013            A         100
1  1/1/2013            B         200
2  1/1/2013            C         300
3  1/2/2013            A         101
4  1/2/2013            C         301
5  1/3/2013            A         102
6  1/3/2013            B         202
7  1/3/2013            C         302

In [68]:
temp.pivot_table(index='date', columns='product_name',values='total_sold').fillna(0)

product_name      A      B      C
date
1/1/2013      100.0  200.0  300.0
1/2/2013      101.0    0.0  301.0
1/3/2013      102.0  202.0  302.0

In [90]:
temp.set_index(['date', 'product_name'])['total_sold']

date      product_name
1/1/2013  A               100
          B               200
          C               300
1/2/2013  A               101
          C               301
1/3/2013  A               102
          B               202
          C               302
Name: total_sold, dtype: int64

In [86]:
temp.set_index(['date', 'product_name'])['total_sold'].unstack(fill_value=0)

product_name    A    B    C
date
1/1/2013      100  200  300
1/2/2013      101    0  301
1/3/2013      102  202  302